# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\dr\Documents\GitHub\SHW\SHW_full\SHW_full.cydsn\SHW_full.cyprj
# Date: Wed, 01 Nov 2017 04:13:05 GMT
#set_units -time ns
create_clock -name {SHIFT_CLK(routed)} -period 1250 -waveform {0 625} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {DAC_SLOW_IntClock(routed)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {DAC_FAST_IntClock(routed)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_SAR_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_SAR_theACLK(fixed-function)} -period 83.333333333333329 -waveform {0 41.6666666666667} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {SHIFT_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 31 61} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {DAC_SLOW_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {DAC_FAST_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {SLOT_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 301 601} [list [get_pins {ClockBlock/dclk_glb_4}]]


# Component constraints for C:\Users\dr\Documents\GitHub\SHW\SHW_full\SHW_full.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\dr\Documents\GitHub\SHW\SHW_full\SHW_full.cydsn\SHW_full.cyprj
# Date: Wed, 01 Nov 2017 04:12:56 GMT
